// Для арифметических операций с большими числами, которые не могут быть
// представлены в памяти компьютера, используется следующий прием. Каждая
// цифра таких чисел записывается в отдельный элемент массива, и необходимые
// операции проводятся с элементами массива цифр. Составить программу:
// а) выполняющую сложение 20-значных чисел;
// б) выполняющую вычитание 30-значных чисел; 


void main() {

  //8.a)
  String a = "12345678901234567890";
  var list1 = [];
  for (int b = 0; b < a.length; b++) {
    list1.add(a[b]);
  }
  print(list1);

  //8.b)
  String c = "123456789434545645567501234567890";
  var list2 = [];
  for (int d = 0; d < c.length; d++) {
    list2.add(a[d]);
  }
  print(list2);


}
